package com.naskogeorgiev.homework10092016.activities;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;

import com.naskogeorgiev.homework10092016.fragments.FragmentArticleInfo;
import com.naskogeorgiev.homework10092016.interfaces.IArticleSelected;
import com.naskogeorgiev.homework10092016.R;
import com.naskogeorgiev.homework10092016.interfaces.IPopulateArticleInfo;
import com.naskogeorgiev.homework10092016.models.Article;
import com.naskogeorgiev.homework10092016.interfaces.IPopulateArticles;

import java.util.ArrayList;

public class TaskOneActivity extends AppCompatActivity implements IArticleSelected, IPopulateArticles, IPopulateArticleInfo {

    private ArrayList<Article> data;
    private Article currentArticle;
    private FragmentArticleInfo fragmentArticleInfo;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

        data = new ArrayList<>();
        generateData();
        setContentView(R.layout.activity_task_one);
        fragmentArticleInfo = (FragmentArticleInfo) getSupportFragmentManager().findFragmentById(R.id.fragment_article_info);
    }

    void generateData() {
        data.add(new Article("Над 700 хиляди деца влизат в класните стаи",
                "66 611 деца тръгват за първи път на училище днес. През миналата година първокласниците са били 67 503. \n" +
                        "Броят на учениците от 1 до 12 клас през новата учебна година ще е 719 405, по прогнозни данни на регионалните управления по образование. През миналата година в дневна форма на обучение са били включени 718 370 ученици. "));
        data.add(new Article("850 лева данък за всяко такси в София догодина",
                "850 лева годишен данък за всяко такси ще плащат превозвачите в София. \n" +
                        "Това предвижда промяна в Наредбата за местните данъци и такси в столицата, след като през април влезе в сила новият данък върху таксиметров превоз на пътници. Всяка община трябва да определи сама размера му между 300 и 900 лева всяка година до 30 октомври. За тази година обаче този срок е 30 септември."));
        data.add(new Article("Патриотичният фронт издаде буквар, пълен с правописни грешки",
                "Патриотичния фронт издаде буквар, който реши днес, на първия учебен ден, да раздава на децата. Оказа се обаче, че учебникът им е пълен с правописни грешки.\n" +
                        "„Да се раздава буквар на децата, това не е морално, отделен е въпросът, че противоречи на редица закони“, каза пред OFFNews депутатът от ДБГ Антони Тренчев."));
        data.add(new Article("Найджъл Кенеди кацна в София късно снощи",
                "Световноизвестният цигулар Найджъл Кенеди кацна в София късно снощи с полет от Лондон. Във видимо добро настроение той бе посрещнат на летището от своя дългогодишен приятел от България – художника Румен Рачев.\n" +
                        "Той му бе подготвил специална изненада – ръчно изрисувана от него цигулка Kремона, първа бройка от предстояща дизайнерска младежка серия на марката, която ще бъде подписана от известния цигулар. Вчера през деня пристигнаха и петимата членове на бандата му, които кацнаха у нас от различни точки на света."));
        data.add(new Article("Борисов: Ако Бокова беше наш кандидат, да съм я отзовал отдавна",
                "Ако ГЕРБ беше излъчила Ирина Бокова за кандидат за шеф на ООН, щях да съм я отзовал много отдавна. Това казва премиерът Бойко Борисов по време на заседанието на Министерския съвет във вторник, става ясно от стенограмата от заседанието. \n" +
                        "\"До този момент минаха четири изслушвания. За съжаление, нашият кандидат е трети, пети, седми, пети. С цялото ми уважение, дори Македония и Сърбия са преди нас. Някой явно иска недоброто си представяне в един момент да ми го припише на мен, на вас, на България."));
        data.add(new Article("Фандъкова: Не бива политиците да нагнетяваме още повече напрежение с бежанците",
                "Не бива политиците да нагнетяваме още повече напрежение с бежанците, а да се погрижим да намерим най-работещите механизми. Това коментира пред журналисти кметът на София Йорданка Фандъкова в отговор на въпрос за организиран от ВМРО утре протест срещу бежанския център в ж.к. \"Овча купел\" с искане за неговото затваряне, съобщава БНТ.\n" +
                        "\n" +
                        "Отварянето и затварянето на центровете се осъществява от Министерски съвет и това от ВМРО, които са подали уведомлението за този протест, го знаят отлично. Бих искала да ги призова - не е мястото там, това не зависи нито от хората вътре, нито от живеещите отвън, а единствено предполага създаване на напрежение, заяви Фандъкова."));
        data.add(new Article("4 постановки за общо 15 лв. в Сатирата през октомври",
                "На 6 октомври Сатиричният театър открива 60-ия си юбилеен сезон с подарък за зрителите - четири спектакъла на обща цена от 15 лева за трите дни в края на седмицата - 7, 8 и 9 октомври.\n" +
                        " \n" +
                        "Освен вечерните представления за големи в пакетната цена влиза и едно от детските дневни представления - „Новите дрехи на краля“."));
        data.add(new Article("Сърбия задържа оръжие за джихадисти. Трафикантите - с фалшиви БГ паспорти",
                "Сръбското МВР задържа четирима души, които са се опитали да преминат границата с Унгария, пренасяйки оръжие и боеприпаси. Всички те са били с фалшиви български паспорти, съобщават сръбските медии.\n" +
                        "\n" +
                        "Освен полицаи в акцията по задържането на трафикантите са участвали и служители на сръбското контраразузнаване.\n" +
                        "\n" +
                        "Според разследващите оръжието и боеприпасите са били предназначени за ислямистки терористични групи в Европа, съобщи БГНЕС."));
        data.add(new Article("Проблемът ни е в човека с белия голф",
                "Макар и провел се вчера, протестът на родителите на деца с увреждания, още е в съзнанието ми. Часове не мога да забравя това, което видях и почувствах – отчаяние. Огромно отчаяние на едни родители, не за друго, а за собствените им деца. Това са децата им, които бяха на този протест поне 6-7 часа и никой не поиска да ги види и да поговори с тях. На 30 градуса жега, те стояха часове в инвалидните си колички.\n" +
                        "\n" +
                        "Майките, докарани до истерия от незаинтересоваността на държавата, плакаха, реваха, крещяха и се извиняваха за това."));
        data.add(new Article("Иван Гърбев - учителят, който обикаляше света от класната стая",
                "Всеки от нас е имал своя любим учител и вероятно той е сложил най-силният отпечатък в живота му. Учителят, на когото се е възхищавал, на когото е искал да прилича, в когото е бил по детски влюбен, учителят, който е формирал представите му за добро и зло.\n" +
                        "\n" +
                        "Искаме да разкажем за тези учители...\n" +
                        "\n" +
                        "OFFNews благодари на Министерството на образованието, което подкрепя поредицата \"Българският учител\", в която ще се опитаме да разкажем, за истинските герои, за хората, към които изпитваме огромно уважение."));
    }

    @Override
    public void onItemSelected(int position) {
        currentArticle = data.get(position);
        fragmentArticleInfo.updateArticle(currentArticle);
    }

    @Override
    public ArrayList<Article> getArticles() {
        return data;
    }

    @Override
    public Article populateArticle() {
        if (currentArticle != null)
            return currentArticle;
        else
            return data.get(0);
    }
}
